01 WS-CUSTOMER-NAME PIC X(30).

MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-NAME = SPACES THEN
    DISPLAY "Customer name is missing."
    STOP RUN.
END-IF.

*--Improved Version --*
01 WS-CUSTOMER-NAME PIC X(30).
01 WS-CUSTOMER-NAME-NUMERIC PIC 9(10) VALUE 0.

MOVE SPACES TO WS-CUSTOMER-NAME.

IF WS-CUSTOMER-NAME = SPACES THEN
    DISPLAY "Customer name is missing."
    STOP RUN
ELSE
    IF NUMERIC(WS-CUSTOMER-NAME) = TRUE THEN
        DISPLAY "Error:Customer Name should be alphabetic"
        STOP RUN
    END-IF
END-IF.